In [5]:
import pandas as pd

data={
    "name":['John','Anna','Peter', 'linda','james'],
    "age":[28,30,40,22,25],
    "city":['New York','London','Paris','Berlin','Madrid'],
    "salary":[50000, 55000,60000,45000,70000]
}
#create dataframe and display first 3 rows
df=pd.DataFrame(data)
df.head(3)

    name  age      city  salary
0   John   28  New York   50000
1   Anna   30    London   55000
2  Peter   40     Paris   60000

In [6]:
# Select the column "Salary" and print it.
df['salary']

0    50000
1    55000
2    60000
3    45000
4    70000
Name: salary, dtype: int64

In [7]:
# Select the row where the "Name" is "Peter".
df.loc[df['name']=='Peter']

    name  age   city  salary
2  Peter   40  Paris   60000

In [9]:
# Select the "Age" and "City" columns for all rows.
df[['age', 'city']]

   age      city
0   28  New York
1   30    London
2   40     Paris
3   22    Berlin
4   25    Madrid

In [15]:
# Add a new column "Bonus" with values: [2000, 2500, 3000, 1000, 3500]
df['Bonus']=[2000, 2500, 3000, 1000, 3500]
df.head()

    name  age      city  salary  Bonus
0   John   28  New York   50000   2000
1   Anna   30    London   55000   2500
2  Peter   40     Paris   60000   3000
3  linda   22    Berlin   45000   1000
4  james   25    Madrid   70000   3500

In [17]:
# Calculate a new column "Total Income" which is the sum of "Salary" and "Bonus".
df['Total Income'] = df['salary']+df['Bonus']
df.head()

    name  age      city  salary  Bonus  Total Income
0   John   28  New York   50000   2000         52000
1   Anna   30    London   55000   2500         57500
2  Peter   40     Paris   60000   3000         63000
3  linda   22    Berlin   45000   1000         46000
4  james   25    Madrid   70000   3500         73500

In [18]:
# Filter the rows where the "Age" is greater than 30.
df.loc[df['age']>30]

    name  age   city  salary  Bonus  Total Income
2  Peter   40  Paris   60000   3000         63000

In [19]:
# Filter the rows where the "Salary" is greater than or equal to 55000.
df.loc[df['salary']>=50000]

    name  age      city  salary  Bonus  Total Income
0   John   28  New York   50000   2000         52000
1   Anna   30    London   55000   2500         57500
2  Peter   40     Paris   60000   3000         63000
4  james   25    Madrid   70000   3500         73500

In [21]:
df.sort_values(by='age', ascending=False)

    name  age      city  salary  Bonus  Total Income
2  Peter   40     Paris   60000   3000         63000
1   Anna   30    London   55000   2500         57500
0   John   28  New York   50000   2000         52000
4  james   25    Madrid   70000   3500         73500
3  linda   22    Berlin   45000   1000         46000

In [22]:
# Sort the DataFrame by "Salary" in descending order.
df.sort_values(by='salary', ascending=False)

    name  age      city  salary  Bonus  Total Income
4  james   25    Madrid   70000   3500         73500
2  Peter   40     Paris   60000   3000         63000
1   Anna   30    London   55000   2500         57500
0   John   28  New York   50000   2000         52000
3  linda   22    Berlin   45000   1000         46000

In [23]:
# Group the DataFrame by "City" and calculate the average salary for each city.
df.groupby('city')['salary'].mean()

city
Berlin      45000.0
London      55000.0
Madrid      70000.0
New York    50000.0
Paris       60000.0
Name: salary, dtype: float64

In [24]:
# Create a new column "Age Group" where:
# Age under 30 is categorized as "Young"
# Age 30 or above is categorized as "Adult"
df['Age Group'] = df['age'].apply(lambda x: 'Young' if x<30 else 'Adult')

In [25]:
df.head()

    name  age      city  salary  Bonus  Total Income Age Group
0   John   28  New York   50000   2000         52000     Young
1   Anna   30    London   55000   2500         57500     Adult
2  Peter   40     Paris   60000   3000         63000     Adult
3  linda   22    Berlin   45000   1000         46000     Young
4  james   25    Madrid   70000   3500         73500     Young

In [27]:
# Use a lambda function to calculate the "Salary after Tax" which is 90% of the "Salary".
df['Salary After Tax'] = df['salary'].apply(lambda x: x*0.9)
df.head()

,name,age,city,salary,Bonus,Total Income,Age Group,Salary After Tax
0,John,28,New York,50000,2000,52000,Young,45000.0
1,Anna,30,London,55000,2500,57500,Adult,49500.0
2,Peter,40,Paris,60000,3000,63000,Adult,54000.0
3,linda,22,Berlin,45000,1000,46000,Young,40500.0
4,james,25,Madrid,70000,3500,73500,Young,63000.0